/* 5. Написати умовну конструкцію, яка в залежності від часу доби виводитиме відповідне привітання. Потрібно отримати реальний час доби із системи. Зробити 2 способами через 2 різних умовних оператора.
В діапазоні годин 23-5 – має виводитися привітання “Доброї ночі”
В діапазоні годин 5-11 – має виводитися привітання “Доброго ранку”
В діапазоні годин 11-17 – має виводитися привітання “Доброї дня”
В діапазоні годин 17-23 – має виводитися привітання “Доброї вечора”. */

let newDate = new Date();
let date = newDate.getHours();

(date >= 23 || date <= 5) ? alert('good night') 
: (date > 5 || date <= 11) ? alert('good morning')
: (date > 11 || date <= 17) ? alert('good day')
: alert('good evening');